# EndParameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExtrusionAnalyzer..::..EndParameter Property
ExtrusionAnalyzer Class See Also
---
The end parameter (distance along the extrusion direction from the input plane) calculated by the extrusion analysis.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double EndParameter { get; }
```

Visual Basic
---
```text
Public ReadOnly Property EndParameter As Double
	Get
```

Visual C++
---
```text
public:
property double EndParameter {
	double get ();
}
```

# See Also
ExtrusionAnalyzer Class
Autodesk.Revit.DB Namespace